my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

my_list.sort(reverse=True) # Сортиране, преиндексация
print(my_list)

my_list.pop() # Трие последния елемент, НО И ГО ВРЪЩА!
print(my_list)
print(my_list.pop(0)) # Трие първия, връща => Индекс

my_list.remove(2) # Премахва първото съвпадение на търсената стойност
# Remove -> Value
# Pop -> Index

my_list.insert(5, "Gosho") # На индекс X добавя елемент със стойност "Gosho", преиндексиране след стойността

number = my_list.index(2) # връща индекса, на който се намира стойността в
                          # скобите, при повторение на елемент връща първата намерена стойност
                          # ако търсеният елемент липсва => ValueError

repetition = my_list.count(2) # Връща броя повторения на даден елемент в списъка

my_list.reverse() # Обръща листа, my_list[::-1]

del my_list[3] # Трие по индекс

my_list_1 = [1, 2, 3, 4, 5, 6]
my_list_2 = my_list_1 # При манипулация на единия списък, се променя и другия
my_list_2 = my_list_1.copy() # При манипулация на лист 2, лист 1 не се променя






